# Profile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryConnectorData..::..Profile Property
DuctFittingAndAccessoryConnectorData Class See Also
---
The connector profile.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ConnectorProfileType Profile { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Profile As ConnectorProfileType
	Get
```

Visual C++
---
```text
public:
property ConnectorProfileType Profile {
	ConnectorProfileType get ();
}
```

# See Also
DuctFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Mechanical Namespace